{
  "name": "Inferring Emotional States",
  "description": "This task involves analyzing given scenarios or descriptions of behavior to infer the emotional states of individuals. It evaluates the model's ability to understand and interpret human emotions based on contextual cues and actions.",
  "modality": "Text only",
  "diagram": null,
  "citations": null,
  "examples": [
    [
      {
        "input": "Lila has been pacing back and forth in the waiting room for the past hour. She keeps checking her phone and biting her nails. What emotional state might Lila be experiencing?",
        "output": "Based on the described behavior, Lila is likely experiencing anxiety or nervousness. The pacing indicates restlessness, while repeatedly checking her phone suggests she's anticipating news or an update. Nail-biting is a common stress response. These behaviors collectively point to a state of worry or unease, typical of someone feeling anxious about an uncertain situation or outcome."
      }
    ],
    [
      {
        "input": "During a heated debate, Marcos suddenly goes quiet, clenches his fists, and leaves the room, slamming the door behind him. What emotional state might Marcos be experiencing?",
        "output": "Marcos is likely experiencing anger or frustration. The sudden silence suggests a shift from verbal expression to physical manifestation of emotion. Clenching fists is often associated with suppressed anger or tension. Leaving the room abruptly and slamming the door are actions that indicate a loss of emotional control and a desire to remove oneself from the situation. These behaviors collectively suggest that Marcos is feeling intense anger or frustration that he's struggling to manage in the moment."
      }
    ],
    [
      {
        "input": "After receiving an unexpected gift, Yara's eyes widen, her mouth opens slightly, and she lets out a small gasp. What emotional state might Yara be experiencing?",
        "output": "Yara is likely experiencing surprise, possibly mixed with joy or excitement. The widening of her eyes is a classic sign of surprise, indicating an unexpected event. The slightly open mouth and small gasp further reinforce this interpretation, as these are typical physiological responses to sudden, unexpected stimuli. Given that the surprise is in response to receiving a gift, it's likely a positive surprise, potentially accompanied by happiness or excitement. The overall reaction suggests Yara is experiencing a moment of pleasant astonishment."
      }
    ]
  ],
  "tags": [
    "Emotional Intelligence",
    "Behavioral Analysis",
    "Social Cognition",
    "Psychological Interpretation",
    "Non-verbal Communication",
    "Synthetic"
  ]
}